import json
from typing import Annotated, Dict, List
from error.error import CallMeError
from pydantic import BaseModel, Field


# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█▀▀░█░█░█▀█░█▀▀░▀█▀░▀█▀░█▀█░█▀█░░░█▀▄░█▀▀░█▀▀░░
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░█▀▀░█░█░█░█░█░░░░█░░░█░░█░█░█░█░░░█░█░█▀▀░█▀▀░░
# ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▀░░░▀▀▀░▀░▀░▀▀▀░░▀░░▀▀▀░▀▀▀░▀░▀░░░▀▀░░▀▀▀░▀░░░░
class FuncDef(BaseModel):
    name: Annotated[str, Field(min_length=3)]
    description: Annotated[str, Field(min_length=3)]
    parameters: Dict[str, Dict[str, str]]
    returns: Dict[str, str]


# ░░░░░░░░░░░░░░░░░█▀█░█▀█░█▀▄░█▀▀░█▀▀░░░█▀▀░█░█░█▀█░█▀▀░▀█▀░▀█▀░█▀█░█▀█░█▀▀░░
# ░░░░░░░░░░░░░░░░░█▀▀░█▀█░█▀▄░▀▀█░█▀▀░░░█▀▀░█░█░█░█░█░░░░█░░░█░░█░█░█░█░▀▀█░░
# ░░░░░░░░░░░░░░░░░▀░░░▀░▀░▀░▀░▀▀▀░▀▀▀░░░▀░░░▀▀▀░▀░▀░▀▀▀░░▀░░▀▀▀░▀▀▀░▀░▀░▀▀▀░░
@CallMeError.catch("Function definition parser")
def parse_functions(path: str) -> List[FuncDef]:

    with open(path) as file:
        json_list = json.loads(file.read())
        functions = [FuncDef.model_validate(func) for func in json_list]
        return functions
